erpnextturkish/eirsaliye/api/validate_eirsaliye.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.connector.uut.cs.com.tr/">
   <soapenv:Header> 
 <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
 <wsse:UsernameToken>
<wsse:Username>{{context.user}}</wsse:Username>
<wsse:Password>{{context.password}}</wsse:Password>
</wsse:UsernameToken> 
 </wsse:Security>
</soapenv:Header>
   <soapenv:Body>
      <ser:gidenBelgeDurumSorgulaExt>
         <!--Optional:-->
         <vergiTcKimlikNo>{{context.td_vergi_no}}</vergiTcKimlikNo>
         <!--Optional:-->
         <parametreler>
            <belgeNo>{{context.belgeno}}</belgeNo>
            <belgeNoTipi>OID</belgeNoTipi>
            <donusTipiVersiyon>6.0</donusTipiVersiyon>


            <!--Zero or more repetitions:
            <belgeNoList></belgeNoList>
            -->
            <!--Optional:
            <belgeTuru></belgeTuru>
            -->
         </parametreler>
      </ser:gidenBelgeDurumSorgulaExt>
   </soapenv:Body>
</soapenv:Envelope>